export type PLACEHOLDERTYPE = {
  item: string;
  description: string;
};

export const PLACEHOLDER_CONSTANT: PLACEHOLDERTYPE[] = [
  {
    item: '치킨',
    description:
      '주말 저녁, 치킨을 주문하고 싶은 마음이 굴뚝같아. 하지만, 최근에 외식 비용이 늘어난 걸 생각하면 망설여지네.',
  },
  {
    item: '노트북',
    description:
      '노트북이 쓸만하긴한데, 화면에 멍이 살짝 들어서 새로 살까 고민 중이야. 그렇게 불편하진 않지만..새 거 갖고 싶어.',
  },
  {
    item: '선크림',
    description:
      '햇빛이 점점 강해져서 이제 슬슬 선크림을 새로 준비할 때가 된 것 같아. 좋은 선크림은 가격이 좀 나가는 편이라 예산을 생각하면 고민돼.',
  },
  {
    item: '헤드셋',
    description:
      '온라인 회의가 많아져서 질 좋은 헤드셋을 찾고 있는데, 노이즈 캔슬링 기능이 있는 제품은 가격이 두 배 이상이라 망설여져.',
  },
  {
    item: '마우스',
    description:
      '프로젝트 때문에 컴퓨터 작업이 많아져서 고성능 마우스가 필요해졌어. 하지만 생각보다 가격이 쎄서 고민 중이야. 효율성과 손목 건강을 위해서 투자하는 게 좋겠지?',
  },
  {
    item: '블루투스 이어폰',
    description: '블루투스 이어폰이 있긴한데, 노이즈 캔슬링 기능이 있는 걸로 바꾸고 싶어.',
  },
  {
    item: '핸드크림',
    description:
      '날씨가 계속 건조하다보니 손도 너무 건조해서 핸드크림이 절실히 필요해. 좋은 제품은 가격이 만만치 않아서 고민이야. 하지만 손 피부 건강도 중요하고 향도 중요하니까 사는 게 좋겠지?',
  },
  {
    item: '닌텐도',
    description:
      '친구들이랑 동물의 숲 같이 하고 싶어서 고민 중이야. 그런데 본체와 게임 다 구매하는 건 부담스럽기도 해. 그리고 요즘 바빠서 사면 할 시간도 없을 거 같긴 해.',
  },
  {
    item: '아우터',
    description:
      '봄이 왔으니 가볍게 걸칠 아우터를 새로 장만하고 싶어. 근데 요즘 봄 아우터 가격이 생각보다 더 올라서 고민이야.',
  },
  {
    item: '신발',
    description:
      '스포츠를 더 열심히 하려고 새 운동화를 눈여겨보고 있는데, 정작 기존에 신던 거도 아직 괜찮아. 그런데 새 신발 갖고 싶다..',
  },
  {
    item: '넷플릭스',
    description: '집에서 영화나 시리즈를 즐기려고 넷플릭스 구독을 고려 중인데, 매달 나가는 구독료가 부담되네.',
  },
  {
    item: '운동복',
    description: '멋지고 편한 운동복 갖고 싶어. 그런데 기능성 운동복은 가격대가 높아서 여러 벌 구비하기가 부담스러워.',
  },
  {
    item: '커피',
    description:
      '오늘따라 커피가 더욱 간절한데, 가격 대비 만족할만한 맛을 찾기가 쉽지 않아. 집에서 퀄리티 높은 커피를 즐길 방법은 없을까.',
  },
  {
    item: '건조기',
    description:
      '비 오는 날 빨래 건조의 번거로움을 생각하면 건조기가 참 좋을 것 같긴 한데, 그동안도 없이도 잘 지냈어서.. 쓸데없는 지출일 거 같긴 해.',
  },
  {
    item: '비타민',
    description:
      '최근 들어 건강을 위해 비타민을 추가하려고 하는데, 종류가 너무 많아서 선택장애가 오고 가격도 부담되네. 건강은 투자하는 게 맞겠지?',
  },
  {
    item: '향수',
    description:
      '기존에 쓰던 향수도 아직 많이 남았는데, 새로운 향수 테스트 해보고 나니까 이상하게 그 향이 계속 생각나. 사지 말아야 하는데...',
  },
  {
    item: '신발',
    description:
      '러닝을 시작해서 좋은 신발을 찾고 있는데, 품질 좋은 제품은 가격이 만만치 않아서 고민 중이야. 운동 효과를 위해서는 필요한 지출이 맞겠지?',
  },
  {
    item: '커피머신',
    description:
      '회사에서 내려 마시는 거도 괜찮긴 한데, 집에서 직접 내린 커피가 끌려. 내가 좋아하는 원두로 내려 마실 수 있잖아. 그런데 막상 출근 준비하면서 커피 내려가는 게 귀찮기도 하고..',
  },
  {
    item: '탈모샴푸',
    description:
      '최근 머리카락이 조금씩 빠지는 것 같아서 탈모샴푸를 알아보고 있는데, 효과가 있는 제품은 가격이 높아서 망설여지네.',
  },
  {
    item: '무선 충전 패드',
    description: '지금 핸드폰 충전기도 잘 작동하는데, 새로운 무선 충전 패드에 눈길이 가네.',
  },
  {
    item: '레인부츠',
    description:
      '장마철에 신을 레인부츠 하나 있으면 좋겠어. 신발 젖는 거 진짜 싫긴한데, 좋은 품질의 방수 부츠는 가격이 만만치 않아서 조금 부담스럽긴 해.',
  },
  {
    item: '에어태그',
    description:
      '지갑을 잘 잃어버려서 에어태그를 살까하는데, 가격이 생각보다 부담스럽기도 하고 꼭 필요한 물건인지 고민이되네.',
  },
  {
    item: '이북리더기',
    description:
      '종이책도 많고 스마트폰으로도 책을 읽을 수 있는데, 이북리더기가 눈에 들어오기 시작했어. 필요한지는 모르겠는데, 뭔가 갖고 싶은 마음이 계속 들어.',
  },
];


export const DESCRIPTION_CONSTANT = [
  {
    title: '',
    contents: "아래 예시를 참고하여 자세히 질문해보세요!  사라에게 더 만족스러운 답변을 받을 수 있을 거예요!"
  },
  {
    title: '✅ 이렇게 질문하면 좋아요!',
    contents: '어떤 이유로 고민하게 되었는지, 고민의 원인을 자세히 적어주세요. (장/단점 등 예시)\n집에서 일하는 시간이 많아져서 좋은 의자를 살까 고민 중이야. 지금 쓰는 의자도 괜찮긴 한데, 인체공학적인 의자를 쓰면 허리도 덜 아프고 일할 때 더 편할 것 같아.'
  },
  {
    title: '❌ 이렇게 질문하는 건 피해주세요!',
    contents: '너무 간단한 질문: "너무 비싸서", "잘 안 쓸 것 같아" \n' +
      '구매할 수 없는 항목: “손흥민", “피타고라스 정리”\n' +
      '구매와 관련이 없는 질문: “오늘 운세를 알려줘."'
  }
]

export const CONSTANTS_TEXT = {
  item_name_label : {
    sara : {
      ko: '뭘 사고 싶샤?'
    },
    mara : {
      ko: '뭘 사고 싶먀?'
    }
  },
  item_description_label : {
    sara : {
      ko: '왜 고민하고 있샤?'
    },
    mara : {
      ko: '왜 고민하고 있먀?'
    }
  },
  submit_button : {
    sara : {
      ko: '고민하는 물건을 사고 싶샤?'
    },
    mara : {
      ko: '고민하는 물건을 사고 싶먀?'
    }
  },
}